app/controllers/api/holdings_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `holdings`.* FROM `holdings` WHERE `holdings`.`user_id` = 2 ORDER BY `holdings`.`created_at` DESC
---
    def index
      user = User.find(params[:user_id])
      holdings = user.holdings.order(created_at: :desc)

SELECT `users`.* FROM `users` WHERE `users`.`uid` = 'yuki@example.com' LIMIT 1
SELECT `holdings`.* FROM `holdings` WHERE `holdings`.`user_id` = 2 AND `holdings`.`id` = 40
---
    def show
      user = User.find(params[:user_id])
      holding = user.holdings.where(id: params[:id])

SELECT `stocks`.* FROM `stocks` WHERE `stocks`.`id` = 16 LIMIT 1
---
    def create
      user = User.find(params[:user_id])
      holding = user.holdings.new(holding_params)
      if user.save #get_current_dividends
        agent = Mechanize.new
        url = agent.get(holding.stock.url)

SELECT `users`.* FROM `users` WHERE `users`.`uid` = 'yuki@example.com' LIMIT 1
SELECT `holdings`.* FROM `holdings` WHERE `holdings`.`user_id` = 2 AND `holdings`.`id` = 40 LIMIT 1
---
    def update
      user = User.find(params[:user_id])
      holding = user.holdings.where(id: params[:id])
      if holding.update!(holding_params) #get_current_dividends
        agent = Mechanize.new
        url = agent.get(holding.stock.url)

SELECT `users`.* FROM `users` WHERE `users`.`uid` = 'yuki@example.com' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `holdings`.* FROM `holdings` WHERE `holdings`.`user_id` = 2 AND `holdings`.`id` = NULL LIMIT 1
DELETE FROM `holdings` WHERE `holdings`.`id` = 40
---
    def destroy
      user = User.find(params[:user_id])
      holding = user.holdings.where(id: params[:id])
      if holding.destroy!